[
  {
    "id": "cp001",
    "name": "Mango Smoothie",
    "category": "Drinks",
    "price": 129,
    "veg": true,
    "rating": 4.8,
    "image": "https://images.unsplash.com/photo-1653542773369-51cce8d08250?q=80&w=686&auto=format&fit=crop",
    "short": "Thick & creamy mango smoothie",
    "description": "A refreshing blend of ripe mangoes, yogurt, and honey creating a thick, creamy smoothie that's perfect for any time of the day. Made with the finest Alphonso mangoes.",
    "popular": true,
    "chefPick": true,
    "history": "Indian mango drinks have been a part of summer culture for centuries. The mango smoothie tradition evolved from the classic mango lassi, combining Western smoothie techniques with traditional Indian flavors.",
    "ingredients": "Ripe mango pulp, yogurt, honey/sugar, ice",
    "preparation": "Fresh mango pulp is blended with creamy yogurt and a touch of honey until smooth and creamy. Ice is added for the perfect consistency.",
    "serving": "Served in a tall chilled glass with a sprig of fresh mint leaves on top for garnish",
    "nutrition": "Rich in vitamins A and C, probiotics from yogurt, natural sugars for quick energy. A healthy and refreshing beverage.",
    "trivia": "Alphonso mango, known as the 'King of Mangoes', is commonly used in premium smoothies for its superior taste and aroma"
  },
  {
    "id": "cp002",
    "name": "Paneer Tikka",
    "category": "Starters",
    "price": 229,
    "veg": true,
    "rating": 4.6,
    "image": "https://images.unsplash.com/photo-1666001120694-3ebe8fd207be?q=80&w=1170&auto=format&fit=crop",
    "short": "Grilled cottage cheese skewers",
    "description": "Marinated cottage cheese cubes grilled to perfection with bell peppers and onions, served with mint chutney. A signature North Indian starter.",
    "popular": true,
    "chefPick": true,
    "history": "Paneer Tikka has its roots in tandoori cuisine from the Punjab region. It became popular as the vegetarian alternative to Chicken Tikka and is now served in restaurants worldwide.",
    "ingredients": "Paneer (cottage cheese), yogurt, aromatic spices, bell peppers, onions",
    "preparation": "Paneer cubes are marinated in a spiced yogurt mixture for several hours, then skewered with vegetables and grilled in a tandoor or oven until golden and smoky.",
    "serving": "Served hot on skewers with mint chutney and sliced onions on the side",
    "nutrition": "High in protein and calcium from paneer, rich in antioxidants from spices",
    "trivia": "This is the signature North Indian starter found in every restaurant menu globally"
  },
  {
    "id": "cp003",
    "name": "Grilled Salmon",
    "category": "Main Course",
    "price": 499,
    "veg": false,
    "rating": 4.7,
    "image": "https://images.unsplash.com/photo-1519708227418-c8fd9a32b7a2?q=80&w=1170&auto=format&fit=crop",
    "short": "Atlantic salmon with herbs",
    "description": "Fresh Atlantic salmon fillet grilled to perfection with aromatic herbs, garlic, and a hint of lemon. Served with seasonal sautéed vegetables.",
    "popular": true,
    "chefPick": true,
    "history": "Grilled salmon is a popular Western seafood dish with Nordic and European origins. Salmon has been prized for thousands of years for its rich flavor and nutritional benefits.",
    "ingredients": "Atlantic salmon fillet, fresh herbs (dill, parsley), garlic, lemon, olive oil",
    "preparation": "Fresh salmon fillet is seasoned with herbs and garlic, then pan-grilled or oven-baked until the outside is crispy and the inside remains tender and flaky.",
    "serving": "Served with sautéed seasonal vegetables and fresh lemon wedges on the side",
    "nutrition": "Excellent source of omega-3 fatty acids, lean protein, vitamin D, and B vitamins",
    "trivia": "Salmon is considered one of the healthiest fish with Nordic and European origins dating back centuries"
  },
  {
    "id": "cp004",
    "name": "Chocolate Lava Cake",
    "category": "Desserts",
    "price": 179,
    "veg": true,
    "rating": 4.8,
    "image": "https://images.unsplash.com/photo-1511911063855-2bf39afa5b2e?q=80&w=687&auto=format&fit=crop",
    "short": "Warm molten chocolate center",
    "description": "Decadent chocolate cake with a molten chocolate center that flows out when cut. Served warm with a scoop of vanilla ice cream.",
    "popular": true,
    "chefPick": true,
    "history": "The Chocolate Lava Cake, also known as Molten Chocolate Cake, was invented by French chef Michel Bras in 1981. It became a restaurant sensation in the 1990s.",
    "ingredients": "Dark chocolate, butter, eggs, flour, sugar, vanilla extract",
    "preparation": "The cake batter is baked at high temperature for a precise time using the half-baked center method, creating a firm exterior with a liquid chocolate center.",
    "serving": "Served warm, dusted with powdered sugar, with vanilla ice cream pairing on the side",
    "nutrition": "Rich in sugar and fats, provides quick energy. An indulgent dessert treat.",
    "trivia": "Also called 'Molten Lava Cake' because the flowing chocolate center resembles molten lava"
  },
  {
    "id": "m005",
    "name": "Butter Chicken",
    "category": "Main Course",
    "price": 349,
    "veg": false,
    "rating": 4.9,
    "image": "https://images.unsplash.com/photo-1728910107534-e04e261768ae?q=80&w=880&auto=format&fit=crop",
    "short": "Creamy tomato curry with tender chicken",
    "description": "Succulent pieces of tandoori chicken simmered in a rich, creamy tomato-based gravy with aromatic spices and butter. A North Indian classic.",
    "popular": true,
    "history": "Butter Chicken was invented at Moti Mahal restaurant in Delhi by Kundan Lal Gujral in the 1950s. It was created as a way to use leftover tandoori chicken.",
    "ingredients": "Tandoori chicken pieces, tomatoes, cream, butter, Kashmiri red chili, garam masala, kasuri methi (dried fenugreek leaves)",
    "preparation": "Chicken is first roasted in a tandoor, then cooked in a rich buttery tomato gravy with cream and aromatic spices",
    "serving": "Best served with naan bread, kulcha, or jeera rice",
    "nutrition": "High in protein from chicken, rich in calories from cream and butter. A hearty, satisfying meal.",
    "trivia": "Invented at the legendary Moti Mahal restaurant in Delhi, now famous worldwide"
  },
  {
    "id": "m006",
    "name": "Masala Dosa",
    "category": "Main Course",
    "price": 149,
    "veg": true,
    "rating": 4.9,
    "image": "https://images.unsplash.com/photo-1668236543090-82eba5ee5976?q=80&w=1170&auto=format&fit=crop",
    "short": "Crispy rice crepe with spiced potato filling",
    "description": "Thin, crispy fermented rice and lentil crepe filled with spiced potato masala. A South Indian breakfast staple enjoyed worldwide.",
    "popular": true,
    "history": "Masala Dosa is a traditional South Indian food that originated in Udupi, Karnataka. Udupi restaurants popularized it across India and internationally.",
    "ingredients": "Fermented rice and urad dal batter, potatoes, onions, mustard seeds, curry leaves, turmeric, spices",
    "preparation": "Fermented batter is spread thin on a hot griddle to create a crispy dosa. Spiced potato filling is placed inside and folded.",
    "serving": "Served hot with sambar (lentil soup) and coconut chutney on the side",
    "nutrition": "Fermented batter aids digestion, light on stomach, rich in carbohydrates. A healthy breakfast option.",
    "trivia": "Udupi restaurants made this dish famous and it's now one of India's most iconic foods"
  },
  {
    "id": "dr007",
    "name": "Masala Chai",
    "category": "Drinks",
    "price": 49,
    "veg": true,
    "rating": 4.9,
    "image": "https://images.unsplash.com/photo-1625033405953-f20401c7d848?q=80&w=687&auto=format&fit=crop",
    "short": "Indian spiced tea with aromatic spices",
    "description": "Traditional Indian tea brewed with black tea leaves, milk, sugar, and aromatic spices like cardamom, ginger, and cloves. A daily ritual for millions.",
    "popular": true,
    "history": "Masala Chai became integral to Indian tea culture after British colonial influence. The tradition of adding spices has ancient Ayurvedic roots. Roadside tea stalls made it a cultural phenomenon.",
    "ingredients": "Black tea leaves, milk, fresh ginger, cardamom, cloves, black pepper, sugar",
    "preparation": "Spices are first boiled in water to extract flavors, then tea leaves and milk are added and simmered until perfectly brewed",
    "serving": "Traditionally served in small glasses with biscuits on the side",
    "nutrition": "Contains caffeine for alertness, antioxidants from tea, warming spices aid digestion",
    "trivia": "Known as 'cutting chai' in Mumbai when served in half glasses at roadside stalls"
  },
  {
    "id": "m008",
    "name": "Chicken Biryani",
    "category": "Main Course",
    "price": 379,
    "veg": false,
    "rating": 4.8,
    "image": "https://images.unsplash.com/photo-1631515243349-e0cb75fb8d3a?q=80&w=1188&auto=format&fit=crop",
    "short": "Aromatic basmati rice with spiced chicken",
    "description": "Fragrant basmati rice layered with marinated chicken, caramelized onions, saffron, and aromatic spices. Slow-cooked to perfection.",
    "popular": true,
    "history": "Biryani has Mughlai and Persian origins, brought to India by Mughal rulers. It evolved into various regional styles, with Hyderabadi and Lucknowi biryani being the most famous.",
    "ingredients": "Basmati rice, chicken, yogurt, fried onions, saffron, biryani spices (cardamom, cinnamon, bay leaves), ghee",
    "preparation": "Rice and marinated chicken are layered and cooked using the dum method (slow cooking in a sealed pot) to create perfectly aromatic biryani",
    "serving": "Served hot with raita (yogurt dip), boiled egg, and salan (gravy)",
    "nutrition": "Balanced meal with carbohydrates from rice and protein from chicken. Rich in spices with health benefits.",
    "trivia": "Multiple regional styles exist including Hyderabadi, Lucknowi, Kolkata, and Malabar biryani"
  },
  {
    "id": "d009",
    "name": "Gulab Jamun",
    "category": "Desserts",
    "price": 99,
    "veg": true,
    "rating": 4.8,
    "image": "https://images.unsplash.com/photo-1666190092159-3171cf0fbb12?w=1000&auto=format&fit=crop&q=60",
    "short": "Soft milk dumplings in rose-scented syrup",
    "description": "Soft, spongy milk-solid dumplings deep-fried and soaked in aromatic rose-cardamom sugar syrup. A festive Indian sweet.",
    "popular": true,
    "history": "Gulab Jamun is a festive Indian sweet with Persian origins, brought to India during the Mughal era. Common at weddings and celebrations.",
    "ingredients": "Khoya (milk solids), milk powder, all-purpose flour, sugar syrup infused with rose water and cardamom",
    "preparation": "Milk solids are shaped into balls, deep-fried until golden, then immediately soaked in warm rose-cardamom sugar syrup",
    "serving": "Served warm or at room temperature, often garnished with chopped pistachios",
    "nutrition": "High in sugar and dairy content. An indulgent dessert.",
    "trivia": "Common at Indian weddings and festivals. The name comes from 'gulab' (rose water) and 'jamun' (a berry it resembles)"
  },
  {
    "id": "dr010",
    "name": "Mango Lassi",
    "category": "Drinks",
    "price": 129,
    "veg": true,
    "rating": 4.8,
    "image": "https://images.unsplash.com/photo-1623065422902-30a2d299bbe4?w=1000&auto=format&fit=crop&q=60",
    "short": "Thick & creamy mango yogurt drink",
    "description": "Thick, creamy smoothie made with fresh mangoes, yogurt, and a touch of sugar. Perfectly refreshing and nutritious.",
    "popular": true,
    "history": "Lassi is a North Indian yogurt drink with roots in Punjab. It has been consumed for thousands of years. Mango lassi became famous in the 1960s.",
    "ingredients": "Fresh mango pulp, yogurt, sugar or honey, cardamom powder",
    "preparation": "Fresh mango pulp, yogurt, and sugar are blended together until smooth and creamy",
    "serving": "Served in a chilled glass, often garnished with a mint leaf or mango slice",
    "nutrition": "Rich in probiotics from yogurt, vitamins from mangoes, aids digestion",
    "trivia": "Famous in Punjab and now enjoyed worldwide as a refreshing summer beverage"
  },
  {
    "id": "m011",
    "name": "Paneer Tikka Masala",
    "category": "Main Course",
    "price": 299,
    "veg": true,
    "rating": 4.7,
    "image": "https://media.istockphoto.com/id/1995440034/photo/tandoori-paneer-momos.webp?s=612x612&w=is&k=20",
    "short": "Grilled cottage cheese in rich gravy",
    "description": "Char-grilled paneer cubes cooked in a creamy tomato-onion gravy with bell peppers, aromatic spices and fresh cream. A vegetarian delight.",
    "popular": true,
    "history": "Paneer Tikka Masala was inspired by the famous Chicken Tikka Masala and is now a global favorite in Indian restaurants as a vegetarian option.",
    "ingredients": "Paneer (cottage cheese), tomato-onion gravy, cream, bell peppers, aromatic spices",
    "preparation": "Paneer tikka is first grilled until charred, then added to a rich tomato-cream gravy and simmered",
    "serving": "Best enjoyed with naan bread or roti",
    "nutrition": "Rich and creamy, high in protein and calcium from paneer",
    "trivia": "A global favorite vegetarian dish inspired by Chicken Tikka Masala"
  },
  {
    "id": "s012",
    "name": "Samosa",
    "category": "Starters",
    "price": 59,
    "veg": true,
    "rating": 4.7,
    "image": "https://images.unsplash.com/photo-1601050690597-df0568f70950?q=80&w=1170&auto=format&fit=crop",
    "short": "Crispy fried pastry with spiced potato filling",
    "description": "Golden-fried triangular pastries stuffed with spiced potatoes and peas. Served hot with tamarind and mint chutney.",
    "popular": true,
    "history": "Samosas have Persian origins but became an integral part of Indian street food culture. Now one of India's most iconic snacks.",
    "ingredients": "All-purpose flour shell, spiced potato and green pea filling, cumin, coriander, garam masala",
    "preparation": "Spiced potato filling is wrapped in flour dough, shaped into triangles, and deep-fried until golden and crispy",
    "serving": "Served hot with mint chutney and tamarind chutney",
    "nutrition": "Fried and carb-heavy, best enjoyed as an occasional snack",
    "trivia": "One of India's most iconic street food snacks, enjoyed across the country"
  },
  {
    "id": "s013",
    "name": "Paneer Tikka",
    "category": "Starters",
    "price": 229,
    "veg": true,
    "rating": 4.6,
    "image": "https://images.unsplash.com/photo-1666001120694-3ebe8fd207be?q=80&w=1170&auto=format&fit=crop",
    "short": "Grilled cottage cheese skewers",
    "description": "Marinated cottage cheese cubes grilled to perfection with bell peppers and onions, served with mint chutney. A signature North Indian starter.",
    "popular": true,
    "history": "Paneer Tikka has its roots in tandoori cuisine from the Punjab region. It became popular as the vegetarian alternative to Chicken Tikka.",
    "ingredients": "Paneer (cottage cheese), yogurt, aromatic spices, bell peppers, onions",
    "preparation": "Paneer cubes are marinated in spiced yogurt mixture, then skewered with vegetables and grilled until golden",
    "serving": "Served hot on skewers with mint chutney and sliced onions",
    "nutrition": "High in protein and calcium from paneer, rich in antioxidants from spices",
    "trivia": "This is the signature North Indian starter found in every restaurant menu globally"
  },
  {
    "id": "d014",
    "name": "Jalebi",
    "category": "Desserts",
    "price": 89,
    "veg": true,
    "rating": 4.5,
    "image": "https://www.spicingyourlife.com/wp-content/uploads/2011/09/Jalebi-2.jpg",
    "short": "Crispy sweet spirals in sugar syrup",
    "description": "Crispy, deep-fried flour spirals soaked in saffron-infused sugar syrup. Best enjoyed hot and fresh.",
    "popular": true,
    "history": "Jalebi is an ancient Indian sweet with origins tracing back centuries. It's a common breakfast sweet in North India.",
    "ingredients": "Fermented all-purpose flour batter, sugar syrup, saffron, cardamom",
    "preparation": "Fermented batter is piped in spiral shapes into hot oil, deep-fried until crispy, then immediately dipped in sugar syrup",
    "serving": "Served hot, often paired with rabri (thickened sweetened milk) or enjoyed on its own",
    "nutrition": "Very high in sugar content, an indulgent sweet treat",
    "trivia": "A common breakfast sweet in North India, often enjoyed with milk or rabri"
  },
  {
    "id": "s015",
    "name": "Chole Bhature",
    "category": "Starters",
    "price": 179,
    "veg": true,
    "rating": 4.8,
    "image": "https://madhurasrecipe.com/wp-content/uploads/2025/09/MR-Chole-Bhature-1.jpg",
    "short": "Spicy chickpea curry with fluffy fried bread",
    "description": "Tangy and spicy chickpea curry served with large, fluffy deep-fried bread. A hearty North Indian breakfast favorite.",
    "popular": true,
    "history": "Chole Bhature is a Punjabi and North Indian food specialty, now a popular breakfast and street food across North India, especially famous in Delhi.",
    "ingredients": "Chickpeas cooked with spices (chole masala), all-purpose flour for bhature, yogurt, onions, tomatoes",
    "preparation": "Chickpeas are slow-cooked with aromatic spices. Bhature dough is rolled out and deep-fried until puffed and golden",
    "serving": "Served hot with pickled onions, green chilies, and a side of lassi",
    "nutrition": "High in carbohydrates and protein from chickpeas. A filling meal.",
    "trivia": "Delhi's favorite breakfast and one of the most popular street foods in North India"
  },
  {
    "id": "d016",
    "name": "Kheer (Rice Pudding)",
    "category": "Desserts",
    "price": 129,
    "veg": true,
    "rating": 4.7,
    "image": "https://www.cookwithmanali.com/wp-content/uploads/2017/06/Indian-Rice-Kheer.jpg",
    "short": "Creamy rice pudding with cardamom & nuts",
    "description": "Slow-cooked rice pudding made with milk, sugar, cardamom, and garnished with almonds, pistachios, and saffron strands.",
    "popular": true,
    "history": "Kheer is one of India's oldest desserts, mentioned in ancient texts. It's a temple and festive dessert traditionally prepared during special occasions.",
    "ingredients": "Basmati rice, full-cream milk, sugar, cardamom powder, saffron strands, chopped nuts (almonds, pistachios, cashews)",
    "preparation": "Rice is slow-simmered in milk until creamy, sweetened with sugar, flavored with cardamom, and garnished with nuts and saffron",
    "serving": "Can be served chilled or warm, garnished with nuts and saffron strands",
    "nutrition": "Rich in carbohydrates and calcium from milk. A nourishing dessert.",
    "trivia": "Also known as 'Payesh' in Bengal and 'Payasam' in South India with regional variations"
  },
  {
    "id": "dr017",
    "name": "Fresh Sugarcane Juice",
    "category": "Drinks",
    "price": 79,
    "veg": true,
    "rating": 4.7,
    "image": "https://plus.unsplash.com/premium_photo-1661347868028-55440b53c791?q=80&w=1170&auto=format&fit=crop",
    "short": "Freshly extracted pure sugarcane juice",
    "description": "Freshly pressed sugarcane juice with a squeeze of lime and ginger. Naturally sweet and incredibly refreshing.",
    "popular": true,
    "history": "Sugarcane juice is a common Indian summer drink that has been consumed since ancient times. Very popular in hot climates across India.",
    "ingredients": "Fresh sugarcane stalks, ginger (optional), lemon juice, ice",
    "preparation": "Fresh sugarcane is passed through a mechanical juice extractor, then served with ginger and lemon",
    "serving": "Served chilled over ice in tall glasses",
    "nutrition": "Rich in natural sugars for instant energy, contains minerals like calcium, magnesium, and iron",
    "trivia": "A staple summer drink across India, very popular in hot climates for instant refreshment"
  },
  {
    "id": "m018",
    "name": "Dal Makhani",
    "category": "Main Course",
    "price": 249,
    "veg": true,
    "rating": 4.6,
    "image": "https://www.funfoodfrolic.com/wp-content/uploads/2023/04/Dal-Makhani-1.jpg",
    "short": "Creamy black lentils slow-cooked overnight",
    "description": "Slow-cooked black lentils and kidney beans in a rich, creamy tomato-based gravy with butter and cream. A Punjabi delicacy.",
    "popular": true,
    "history": "Dal Makhani originated from Punjabi dhaba slow-cook traditions and was popularized by restaurants. Traditionally slow-cooked overnight for maximum flavor.",
    "ingredients": "Black lentils (urad dal), kidney beans (rajma), butter, cream, tomatoes, ginger-garlic paste, aromatic spices",
    "preparation": "Lentils are soaked and then slow-simmered for hours with butter, cream, and spices until creamy and rich",
    "serving": "Best served with naan bread, roti, or steamed basmati rice",
    "nutrition": "High in protein from lentils, rich in fats from butter and cream",
    "trivia": "Considered the 'King of Dals' in North Indian cuisine due to its rich, indulgent flavor"
  },
  {
    "id": "d019",
    "name": "Rasgulla",
    "category": "Desserts",
    "price": 119,
    "veg": true,
    "rating": 4.6,
    "image": "https://images.unsplash.com/photo-1714799263412-2e0c1f875959?q=80&w=1130&auto=format&fit=crop",
    "short": "Spongy cottage cheese balls in sugar syrup",
    "description": "Light, spongy cottage cheese balls cooked in light sugar syrup. A Bengali delicacy that's refreshingly sweet.",
    "popular": true,
    "history": "Rasgulla is a Bengal and Odisha sweet. It was popularized by Bengali confectioner Nobin Chandra Das in the 19th century. There's a GI tag dispute between the two states.",
    "ingredients": "Chhena (fresh cottage cheese made from milk), sugar syrup, cardamom, rose water",
    "preparation": "Fresh chhena is kneaded and shaped into balls, then boiled in sugar syrup until they become spongy and absorb the syrup",
    "serving": "Served chilled in the sugar syrup",
    "nutrition": "Moderate protein from cottage cheese, high sugar content",
    "trivia": "Famous GI tag dispute between Bengal and Odisha over its origin"
  },
  {
    "id": "dr020",
    "name": "Nimbu Pani (Lemonade)",
    "category": "Drinks",
    "price": 69,
    "veg": true,
    "rating": 4.6,
    "image": "https://images.unsplash.com/photo-1669207607697-a98803f00e5f?q=80&w=687&auto=format&fit=crop",
    "short": "Refreshing Indian-style lemonade",
    "description": "Freshly squeezed lemon juice with water, sugar, salt, and a hint of cumin. A perfect summer cooler.",
    "popular": true,
    "history": "Nimbu Pani is India's traditional summer drink and thirst quencher, consumed for centuries. Known for its perfect balance of sweet, salty, and tangy flavors.",
    "ingredients": "Fresh lemon juice, water, sugar, salt, roasted cumin powder, black salt, ice",
    "preparation": "Fresh lemon juice is mixed with water, sugar, and salt, then flavored with cumin and chilled",
    "serving": "Served over ice cubes with fresh mint leaves as garnish",
    "nutrition": "Rich in vitamin C, low in calories, helps with hydration",
    "trivia": "Also known as 'Shikanji' in some regions of North India"
  },
  {
    "id": "s021",
    "name": "Vada Pav",
    "category": "Starters",
    "price": 49,
    "veg": true,
    "rating": 4.5,
    "image": "https://cookwithrenu.com/wp-content/uploads/2020/07/Mumbai-Special-Vada-Pav-_-Featured-Image-500x500.jpg.webp",
    "short": "Mumbai's famous potato fritter burger",
    "description": "Spicy mashed potato fritter sandwiched in a soft pav (bun) with chutneys and fried green chilies. Mumbai's iconic street food.",
    "popular": true,
    "history": "Vada Pav was invented in 1966 by Ashok Vaidya near Dadar station in Mumbai. It's now synonymous with Mumbai street food culture.",
    "ingredients": "Spiced potato patty (batata vada), pav bread, green chutney, tamarind chutney, garlic chutney, fried green chilies",
    "preparation": "Spiced mashed potato is coated in gram flour batter and deep-fried. The vada is then placed inside a pav with chutneys",
    "serving": "Served hot with fried green chilies on the side",
    "nutrition": "High in carbohydrates, fried snack. Best enjoyed occasionally.",
    "trivia": "Called the 'Indian burger' and is Mumbai's most iconic street food"
  },
  {
    "id": "s022",
    "name": "Idli Sambhar",
    "category": "Starters",
    "price": 99,
    "veg": true,
    "rating": 4.4,
    "image": "https://images.unsplash.com/photo-1730191843435-073792ba22bc?w=1000&auto=format&fit=crop",
    "short": "Steamed rice cakes with lentil soup",
    "description": "Soft, fluffy steamed rice cakes served with aromatic lentil-vegetable soup and coconut chutney. A South Indian staple.",
    "popular": true,
    "history": "Idli is a South Indian staple and ancient dish mentioned in texts dating back to 920 CE. It's known for being light, healthy, and nutritious.",
    "ingredients": "Fermented rice and urad dal batter for idlis, toor dal (lentils), mixed vegetables, tamarind, sambar spices",
    "preparation": "Fermented batter is steamed in special idli molds. Sambar is prepared by simmering lentils with vegetables and spices",
    "serving": "Served hot with sambar and coconut chutney",
    "nutrition": "Light and fermented, low in fat, easy to digest. One of India's healthiest breakfast options.",
    "trivia": "Considered one of India's healthiest breakfast foods due to fermentation and steaming process"
  }
]
